app/views/categories/index.html.erb

SELECT "categories".* FROM "categories"
SELECT "subcategories".* FROM "subcategories"  WHERE "subcategories"."category_id" = ?  [["category_id", 1]]
---
          <td>
            <% @community.subcategories.each do |subcategory| %>